In [1]:
import pandas as pd

In [83]:
users=pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep='|',index_col=0)

In [7]:
users.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [9]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [35]:
N=users.shape
print('Number of Observations :',N[0])

Number of Observations : 943

In [36]:
N=users.shape
print('Number of Columns :', N[1])

Number of Columns : 4

In [37]:
print(users.columns)

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [42]:
(users.dtypes)

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [41]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [56]:
users['occupation'].nunique()

21

In [94]:
users['occupation'].mode()

0    student
Name: occupation, dtype: object

In [76]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [80]:
print(users['age'].describe(),'\n\n')
print(users['gender'].describe(),'\n\n')
print(users['occupation'].describe(),'\n\n')
print(users['zip_code'].describe(),'\n\n')

count    943.000000
mean      34.051962
std       12.192740
min        7.000000
25%       25.000000
50%       31.000000
75%       43.000000
max       73.000000
Name: age, dtype: float64


count     943
unique      2
top         M
freq      670
Name: gender, dtype: object


count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object


count       943
unique      795
top       55414
freq          9
Name: zip_code, dtype: object

In [97]:
users['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [98]:
users['age'].mean()

34.05196182396607

In [117]:
users['age'].min()

7